#pragma once

#include "GF.h"
#include "bitslib.h"

namespace bf 
{
	int table[32][4] = { 
		{-1,-1,-1,-1},//нулевой
		{-1,-1,-1,-1},//первый, оба не используются, для простоты нумерации добавлены
		{2,1,0,0 },
		{3,1,0,0 },
		{4,1,0,0 },
		{5,2,0,0 },
		{6,1,0,0 },
		{7,1,0,0 },
		{8,4,3,1 },
		{9,1,0,0 },
		{10,3,0,0},
		{11,2,0,0},
		{12,3,0,0},
		{13,4,3,1},
		{14,5,0,0},
		{15,1,0,0},
		{16,5,3,1},
		{17,3,0,0},
		{18,3,0,0},
		{19,5,2,1},
		{20,3,0,0},
		{21,2,0,0},
		{22,1,0,0},
		{23,5,0,0},
		{24,4,3,1},
		{25,3,0,0},
		{26,4,3,1},
		{27,5,2,1},
		{28,1,0,0},
		{29,2,0,0},
		{30,1,0,0},
		{31,3,0,0}
	};

	//Получаем полином из таблицы по его степени.
	bvect32 get_polynom_from_table(int deg)
	{
		if (deg > 31 || deg < 2)
			return 0;

		bvect32 result = 0;
		for (int i = 0; i < 4; i++)
			set_bit_32(result, table[deg][i], 1);

		return result |= 1;
	}
}